app/controllers/customer_informations_controller.rb

  def index
    @customer_informations = CustomerInformation.all
---
SELECT "customer_informations".* FROM "customer_informations"

  def create
    @customer_information = CustomerInformation.new(customer_information_params)

    respond_to do |format|
      if @customer_information.save
---
INSERT INTO "customer_informations" ("Customer_id", "Date_Joined", "Email_Address", "Outstanding_Charges", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["Customer_id", "12356678"], ["Date_Joined", ""], ["Email_Address", ""], ["Outstanding_Charges", ""], ["created_at", "2017-05-22 12:26:26.328786"], ["updated_at", "2017-05-22 12:26:26.328786"]]

  def destroy
    @customer_information.destroy
---
DELETE FROM "customer_informations" WHERE "customer_informations"."id" = ?  [["id", 1]]

    def set_customer_information
      @customer_information = CustomerInformation.find(params[:id])
---
SELECT  "customer_informations".* FROM "customer_informations"  WHERE "customer_informations"."id" = ? LIMIT 1  [["id", 1]]