app/controllers/marketplaces_controller.rb

SELECT "marketplaces".* FROM "marketplaces"
---
  def index
    @marketplaces = Marketplace.all

INSERT INTO "marketplaces" ("Customer_id", "Order_id", "Price", "Product_Name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["Customer_id", "12356678"], ["Order_id", "23549856"], ["Price", "65.99"], ["Product_Name", "Shoes"], ["created_at", "2017-05-22 12:24:23.137786"], ["updated_at", "2017-05-22 12:24:23.137786"]]
---
  def create
    @marketplace = Marketplace.new(marketplace_params)

    respond_to do |format|
      if @marketplace.save

SELECT  "marketplaces".* FROM "marketplaces"  WHERE "marketplaces"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_marketplace
      @marketplace = Marketplace.find(params[:id])